Проект_Услуги/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Проект_Услуги/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	 ФормированиеФИО(Элемент);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Функция ФормированиеФИО(Элемент)
	
	ЗнФИО = "";
	
	Если СокрЛП(Объект.Фамилия) <> "" Тогда
		ЗнФИО = ЗнФИО + ТРег(СокрЛП(Объект.Фамилия)) + " ";
	КонецЕсли;
	
	Если СокрЛП(Объект.Имя) <> "" Тогда
		ЗнФИО = ЗнФИО + ВРег(Лев(СокрЛП(Объект.Имя),1)) + ".";
	КонецЕсли;
	
	Если СокрЛП(Объект.Отчество) <> "" Тогда
		ЗнФИО = ЗнФИО + ВРег(Лев(СокрЛП(Объект.Отчество),1)) + ".";
	КонецЕсли;
	
	Объект.Наименование = ЗнФИО;
	
	Возврат Объект.Наименование;	
		
КонецФункции

#КонецОбласти
